{
    "_name_or_path": "nvidia/segformer-b5-finetuned-ade-640-640",
    "architectures": [
        "SegformerForSemanticSegmentation"
    ],
    "attention_probs_dropout_prob": 0.0,
    "classifier_dropout_prob": 0.1,
    "decoder_hidden_size": 768,
    "depths": [
        3,
        6,
        40,
        3
    ],
    "downsampling_rates": [
        1,
        4,
        8,
        16
    ],
    "drop_path_rate": 0.1,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_sizes": [
        64,
        128,
        320,
        512
    ],
    "id2label": {
        "0": "背景",
        "1": "云",
        "2": "阴影",
        "3": "拉花",
        "4": "模糊",
        "5": "光谱溢出",
        "6": "扭曲"
    },
    "image_size": 224,
    "initializer_range": 0.02,
    "label2id": {
        "云": 1,
        "光谱溢出": 5,
        "扭曲": 6,
        "拉花": 3,
        "模糊": 4,
        "背景": 0,
        "阴影": 2
    },
    "layer_norm_eps": 1e-06,
    "mlp_ratios": [
        4,
        4,
        4,
        4
    ],
    "model_type": "segformer",
    "num_attention_heads": [
        1,
        2,
        5,
        8
    ],
    "num_channels": 3,
    "num_encoder_blocks": 4,
    "patch_sizes": [
        7,
        3,
        3,
        3
    ],
    "reshape_last_stage": true,
    "semantic_loss_ignore_index": 255,
    "sr_ratios": [
        8,
        4,
        2,
        1
    ],
    "strides": [
        4,
        2,
        2,
        2
    ],
    "torch_dtype": "float32",
    "transformers_version": "4.28.1"
}