{
    "_name_or_path": "microsoft/swinv2-base-patch4-window12-192-22k",
    "architectures": [
        "Swinv2ForImageClassification"
    ],
    "attention_probs_dropout_prob": 0.0,
    "depths": [
        2,
        2,
        18,
        2
    ],
    "drop_path_rate": 0.1,
    "embed_dim": 128,
    "encoder_stride": 32,
    "hidden_act": "gelu",
    "hidden_dropout_prob": 0.0,
    "hidden_size": 1024,
    "id2label": {
        "0": "云",
        "1": "阴影",
        "2": "拉花",
        "3": "模糊",
        "4": "光谱溢出",
        "5": "扭曲",
        "6": "拼接痕迹",
        "7": "拼接错误",
        "8": "条状噪声"
    },
    "image_size": 192,
    "initializer_range": 0.02,
    "label2id": {
        "云": 0,
        "光谱溢出": 4,
        "扭曲": 5,
        "拉花": 2,
        "拼接痕迹": 6,
        "拼接错误": 7,
        "条状噪声": 8,
        "模糊": 3,
        "阴影": 1
    },
    "layer_norm_eps": 1e-05,
    "mlp_ratio": 4.0,
    "model_type": "swinv2",
    "num_channels": 3,
    "num_heads": [
        4,
        8,
        16,
        32
    ],
    "num_layers": 4,
    "patch_size": 4,
    "path_norm": true,
    "pretrained_window_sizes": [
        0,
        0,
        0,
        0
    ],
    "problem_type": "multi_label_classification",
    "qkv_bias": true,
    "torch_dtype": "float32",
    "transformers_version": "4.28.1",
    "use_absolute_embeddings": false,
    "window_size": 12
}